In [5]:
import pandas as pd
import numpy as np

data = {
    'emp_id': [1, 2, 3, 4, 5, 6],
    'name': ['Aman', 'Riya', 'Kunal', 'Neha', 'Amit', 'Pooja'],
    'dept': ['IT', 'HR', 'IT', 'HR', 'Finance', 'IT'],
    'salary': [60000, 50000, np.nan, 45000, 70000, np.nan],
    'experience': [3, 2, 4, 1, 6, 5]
}

df = pd.DataFrame(data)
df

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT      NaN           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT      NaN           5

In [6]:
df.isnull().sum()

emp_id        0
name          0
dept          0
salary        2
experience    0
dtype: int64

In [7]:
df["salary"].fillna(df["salary"].mean(),inplace=True)
df

C:\Users\brije\AppData\Local\Temp\ipykernel_19892\2600268242.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["salary"].fillna(df["salary"].mean(),inplace=True)

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT  56250.0           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT  56250.0           5

In [8]:
df.groupby("dept")["salary"].mean()

dept
Finance    70000.0
HR         47500.0
IT         57500.0
Name: salary, dtype: float64

In [9]:
df.groupby("dept").agg({
    "salary":"mean",
    "experience":"max"})

          salary  experience
dept
Finance  70000.0           6
HR       47500.0           2
IT       57500.0           5

In [10]:
df.groupby("dept")["emp_id"].count()

dept
Finance    1
HR         2
IT         3
Name: emp_id, dtype: int64

In [11]:
df["salary_level"]=df["salary"].apply(
    lambda x:"high" if x>60000 else "low"
)

In [12]:
df

   emp_id   name     dept   salary  experience salary_level
0       1   Aman       IT  60000.0           3          low
1       2   Riya       HR  50000.0           2          low
2       3  Kunal       IT  56250.0           4          low
3       4   Neha       HR  45000.0           1          low
4       5   Amit  Finance  70000.0           6         high
5       6  Pooja       IT  56250.0           5          low

In [13]:
df["Bonus"]=df.apply(
    lambda row: row["salary"]*0.2 if row["experience"]>3 else row["salary"]*0.1, axis=1
)
df

   emp_id   name     dept   salary  experience salary_level    Bonus
0       1   Aman       IT  60000.0           3          low   6000.0
1       2   Riya       HR  50000.0           2          low   5000.0
2       3  Kunal       IT  56250.0           4          low  11250.0
3       4   Neha       HR  45000.0           1          low   4500.0
4       5   Amit  Finance  70000.0           6         high  14000.0
5       6  Pooja       IT  56250.0           5          low  11250.0

In [14]:
dept_data = {
    'dept': ['IT', 'HR', 'Finance'],
    'manager': ['Rahul', 'Anita', 'Suresh']
}

df_dept = pd.DataFrame(dept_data)
df_dept

      dept manager
0       IT   Rahul
1       HR   Anita
2  Finance  Suresh

In [15]:
merged_df=pd.merge(df,df_dept,on="dept",how="left")
merged_df

   emp_id   name     dept   salary  experience salary_level    Bonus manager
0       1   Aman       IT  60000.0           3          low   6000.0   Rahul
1       2   Riya       HR  50000.0           2          low   5000.0   Anita
2       3  Kunal       IT  56250.0           4          low  11250.0   Rahul
3       4   Neha       HR  45000.0           1          low   4500.0   Anita
4       5   Amit  Finance  70000.0           6         high  14000.0  Suresh
5       6  Pooja       IT  56250.0           5          low  11250.0   Rahul

In [16]:
merged_df.groupby("manager")["salary"].mean()

manager
Anita     47500.0
Rahul     57500.0
Suresh    70000.0
Name: salary, dtype: float64

In [20]:
df['seniority'] = np.where(
    df['experience'] < 2, 'Junior',
    np.where(df['experience'] <= 4, 'Mid', 'Senior')
)
df

   emp_id   name     dept   salary  experience salary_level    Bonus seniority
0       1   Aman       IT  60000.0           3          low   6000.0       Mid
1       2   Riya       HR  50000.0           2          low   5000.0       Mid
2       3  Kunal       IT  56250.0           4          low  11250.0       Mid
3       4   Neha       HR  45000.0           1          low   4500.0    Junior
4       5   Amit  Finance  70000.0           6         high  14000.0    Senior
5       6  Pooja       IT  56250.0           5          low  11250.0    Senior